Autodesk.Revit.UI.Plumbing.IPipeFittingAndAccessoryPressureDropUIServerProxy.ShowSettings(Autodesk.Revit.UI.Plumbing.PipeFittingAndAccessoryPressureDropUIData)
Shows the settings UI.
data:
The input data of the calculation.
Returns:
True if the user makes any changes in the UI, false otherwise.
Since:
2014

Autodesk.Revit.UI.Plumbing.IPipeFittingAndAccessoryPressureDropUIServerProxy.GetDBServerId
Returns the Id of the corresponding DB server for which this server provides an optional UI.
Remarks:
Note that there may be only one UI server assigned to a DB calculation server.
Returns:
The Id of the DB server.
Since:
2014